ConfigFiles/Catalogs/MCP_УчетныеЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>MCP_УчетныеЗаписи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скоупы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скоуп</Name>
							<Type>
								<v8:Type>cfg:EnumRef.MCP_Скоупы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/MCP_УчетныеЗаписи/Ext/ObjectModule.bsl
// Назначение: генерация и контроль ключа доступа MCP.
// Куда положить: Справочник MCP_УчетныеЗаписи, модуль объекта.
//
// Логика ключа живёт здесь, а не в модуле формы, по двум причинам:
//  - модуль обычной формы хранится в Form.bin и в репозиторий не попадает,
//    то есть не версионируется и не проходит ревью;
//  - тот же ключ нужно уметь выдать не только кнопкой (например, при заполнении
//    новой карточки), а модуль объекта доступен из обоих сценариев.

#Region ПрограммныйИнтерфейс

// Новый ключ доступа MCP.
//
// Два UUID без дефисов = 64 шестнадцатеричных символа, ровно длина реквизита.
// Платформа выдаёт случайные (v4) идентификаторы, поэтому такой ключ подходит
// как секрет; собирать его из даты, кода или имени сотрудника нельзя - он станет
// предсказуемым.
//
// Возвращаемое значение:
//  Строка - ключ. Реквизит НЕ заполняется: вызывающий решает, куда его положить.
//
Функция НовыйКлючДоступа() Экспорт

	Первый = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
	Второй = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");

	Возврат НРег(Первый + Второй);

КонецФункции // НовыйКлючДоступа()

// Заполняет реквизит новым ключом. Отдельная процедура, чтобы обработчик кнопки
// на форме состоял из одной строки.
//
Процедура ПерегенерироватьКлюч() Экспорт

	КлючДоступа = НовыйКлючДоступа();

КонецПроцедуры // ПерегенерироватьКлюч()

#EndRegion

#Region ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	// Новая карточка сразу с ключом: иначе легко сохранить учётную запись без ключа,
	// а потом гадать, почему гейт отвечает 401.
	Если НЕ ЗначениеЗаполнено(КлючДоступа) Тогда
		КлючДоступа = НовыйКлючДоступа();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Активен) Тогда
		Активен = Истина;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ)

	// При загрузке из обмена проверки не выполняем: данные приходят как есть,
	// иначе обмен упадёт на чужой записи.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КлючДоступа = СокрЛП(КлючДоступа);

	Если Активен И НЕ ЗначениеЗаполнено(КлючДоступа) Тогда

		Отказ = Истина;
		Сообщить("Активная учётная запись MCP не может быть без ключа доступа."
			+ " Нажмите «Сгенерировать ключ» или снимите признак «Активен».");
		Возврат;

	КонецЕсли;

	// Ключ обязан быть уникальным: авторизация ищет учётную запись запросом
	// "ПЕРВЫЕ 1 ГДЕ КлючДоступа = &КлючДоступа", и при дубле выбор записи
	// (а значит и набор прав) станет непредсказуемым.
	Если ЗначениеЗаполнено(КлючДоступа) И КлючИспользуется(КлючДоступа, Ссылка) Тогда

		Отказ = Истина;
		Сообщить("Такой ключ доступа уже назначен другой учётной записи MCP."
			+ " Сгенерируйте новый.");
		Возврат;

	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

#EndRegion

#Region СлужебныеПроцедурыИФункции

// Есть ли другая учётная запись с таким же ключом.
//
Функция КлючИспользуется(Ключ, ТекущаяСсылка)

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетныеЗаписи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.MCP_УчетныеЗаписи КАК УчетныеЗаписи
	|ГДЕ
	|	УчетныеЗаписи.КлючДоступа = &Ключ
	|	И УчетныеЗаписи.Ссылка <> &ТекущаяСсылка";

	Запрос.УстановитьПараметр("Ключ", Ключ);
	Запрос.УстановитьПараметр("ТекущаяСсылка", ТекущаяСсылка);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции // КлючИспользуется()

#EndRegion
